# Stepic_Start_in_Java
####################################################################
# Раздел 3.3 - задача 4 (class 3_3__4)
Задача повышенной сложности

На числовой прямой даны два отрезка, заданных парами целых чисел: [a1, b1] и [a2, b2] Напишите программу, которая находит их пересечение.

Если пересечение - отрезок, необходимо вывести два числа (границы отрезка), если единственная точка - единственное число (точку), если пересечения нет - вывести фразу "Пересечения нет" (без кавычек). 

Sample Input 1:

2 5
6 10
Sample Output 1:

Пересечения нет
Sample Input 2:

2 5
4 10
Sample Output 2:

4 5
#########################################################################
# Раздел 3.3 - задача 5 (class 3_3__5)
На вход подаётся три целых числа. Выведите максимальное чётное из них. Если чётных чисел нет, выведите "Чётных чисел нет".

Sample Input:

5 10 15
Sample Output:

10
#######################################################################
# Раздел 3.4 - задача 5 (class 3_4__5)
Реализуйте простой справочник по командам Java. На вход подаётся команда, по которой необходима справка (ограничимся тремя командами). В соответствии с этим выведите текст:

Ввод: System.out.println()

Вывод: Это команда вывода на печать

Ввод: if

Вывод: Это условный оператор

Ввод: else

Вывод: Это альтернативная конструкция условного оператора



Если введено что-либо другое, выведите фразу "" (без кавычек).

Sample Input:

System.out.println()
Sample Output:

Это команда вывода на печать

========================================================================
# Раздел 3.5 - задача 2 (class 3_5__2)
На вход подаётся  целое число. Выведите "YES", если введено трёхзначное положительное число, а в противном случае - "NO".

Sample Input 1:

125
Sample Output 1:

YES
Sample Input 2:

1
Sample Output 2:

NO

###########################################################################

# Раздел 3.5 - задача 3 (class 3_5__3)

На вход подается строка, а затем слово. Выведите true, если слово содержится в строке, и false - если нет, без учёта регистров.

Sample Input:

abracadabra
Cadabra
Sample Output:

true

###########################################################################

# Раздел 3.5 - задача 4 (class 3_5__4)
На вход подаётся целое трёхзначное число, а затем цифра. Выведите true, если эта цифра является средней в числе (разряд десятков), и false - если нет. Если введённое число не является трёхзначным, выведите "error".

Sample Input:

123 2
Sample Output:

true